Tekla.Structures.Model.Assembly
The Assembly class defines a single manufacturing unit: objects that are bolted or welded together in the workshop.
An assembly has a main part and secondary assemblables attached to it. The number of secondaries is limited to 2048.
Hierarchical assemblies can also have subassemblies attached to them and they can have a parent assembly instance.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
Beam beam1 = new Beam(new Point(0,0,0), new Point(1000,0,0));
Beam beam2 = new Beam(new Point(0,0,0), new Point(0,0,1000));
beam1.Profile.ProfileString = "380*380";
beam1.Material.MaterialString = "K40-1";
beam2.Profile.ProfileString = "380*380";
beam2.Material.MaterialString = "K40-1";
beam1.Insert();
beam2.Insert();
Assembly assembly = beam1.GetAssembly();
assembly.Add(beam2);
if(!assembly.Modify())
Console.WriteLine("Assembly Modify Failed!");
}
public void Example2()
{
// Create some rebars.
var rebarSet = new RebarSet();
var rebarGroup = new RebarGroup();
var singleRebar = new SingleRebar();
// Set rebar properties here (code omitted).
rebarSet.Insert();
rebarGroup.Insert();
singleRebar.Insert();
// Create a rebar assembly.
var rebarAssembly = new Assembly();
rebarAssembly.SetMainObject(rebarSet);
rebarAssembly.Add(rebarGroup);
rebarAssembly.Add(singleRebar);
rebarAssembly.Insert();
}
}

Tekla.Structures.Model.Assembly.Name
The name of the assembly.

Tekla.Structures.Model.Assembly._MainPart
The main part of the assembly.

Tekla.Structures.Model.Assembly._MainAssemblyId
The main assembly for the assembly, or null if none.

Tekla.Structures.Model.Assembly._OtherObjects
All the secondary objects of the assembly.

Tekla.Structures.Model.Assembly._SubAssemblies
The subassemblies of the assembly.

Tekla.Structures.Model.Assembly.AssemblyNumber
Defines the numbering in the assembly sense. If the members are empty and zero, the main part attributes are used.

Tekla.Structures.Model.Assembly.#ctor
Creates a new assembly instance.

Tekla.Structures.Model.Assembly.GetMainObject
Selects and returns the main object of the assembly or null if none.
Returns: The main object of the assembly or null.

Tekla.Structures.Model.Assembly.GetMainPart
Selects and returns the main part of the assembly or null if none.
Returns: The main part of the assembly or null.
Deprecated since TS2022, please use GetMainObject instead.

Tekla.Structures.Model.Assembly.SetMainObject(Tekla.Structures.Model.ModelObject)
Sets the main object of the assembly.
mainObject: The Tekla.Structures.Model.Part, Tekla.Structures.Model.Reinforcement, or Tekla.Structures.Model.RebarSet
object to set as the main object of the assembly.
Returns: True if the object is valid; otherwise false.

Tekla.Structures.Model.Assembly.SetMainPart(Tekla.Structures.Model.Part)
Sets the main part of the assembly.
Part: The part to set as the main part of the assembly.
Returns: True if the part was valid.
Deprecated since TS2022, please use SetMainObject instead.

Tekla.Structures.Model.Assembly.GetSecondaries
Selects and returns all the secondary assemblables belonging to the assembly. The method replaces the
old GetObjects() method. Notice that the number of secondaries is limited to 2048.
Returns: An array list containing all the secondary assemblables belonging to the assembly.

Tekla.Structures.Model.Assembly.Add(Tekla.Structures.Model.IAssemblable)
Adds the given assemblable instance to the assembly. Notice that adding
other than assembly instances will assume that you are adding objects to a cast unit assembly.
Object: The part instance to add to the assembly.
Returns: True on success, otherwise false.

Tekla.Structures.Model.Assembly.Add(System.Collections.ArrayList)
Adds an array list of given assemblable instances to the assembly. For assemblies use Add(Assembly Assembly). Notice that adding
other than assembly instances will actually assume that you are adding objects to a cast unit assembly.
Assemblables: A list of assemblables to add to the assembly.
Returns: True on success, otherwise false.

Tekla.Structures.Model.Assembly.Remove(Tekla.Structures.Model.ModelObject)
Removes the given instance from the assembly.
Before removing steel parts from an assembly all connecting workshop welds and bolts must be deleted.
Object: The model object to remove from the assembly.
Returns: True if successfully removed.

Tekla.Structures.Model.Assembly.Insert
Inserts the Tekla.Structures.Model.Assembly instance in the model.
At the moment only rebar assemblies can be inserted.
The main object of the assembly must be a Tekla.Structures.Model.Reinforcement or Tekla.Structures.Model.RebarSet.
If the main rebar is not set (null), the main rebar will be automatically set to the secondary rebar with the biggest weight.
Returns: True if successful; otherwise false.

Tekla.Structures.Model.Assembly.Select
Selects the assembly instance from the model. The identifier of the instance must be set.
Returns: True on success.

Tekla.Structures.Model.Assembly.Modify
Modifies the assembly instance in the model.
Returns: True on success.

Tekla.Structures.Model.Assembly.Delete
Explodes the assembly instance.
Returns: True on success.

Tekla.Structures.Model.Assembly.Add(Tekla.Structures.Model.Assembly)
Adds a new subassembly for the assembly instance.
Assembly: The assembly instance to be added.
Returns: True if the subassembly was successfully added.

Tekla.Structures.Model.Assembly.GetAssembly
Returns the assembly instance the assembly belongs to (null if none).
Returns: The assembly instance or null.

Tekla.Structures.Model.Assembly.GetSubAssemblies
Selects and returns a list of subassemblies belonging to the assembly.
Returns: A list of subassemblies.

Tekla.Structures.Model.Assembly.GetAssemblyType
Returns the type of the assembly.
Returns: The type of the assembly.

Tekla.Structures.Model.Assembly.GetFatherPour
Returns the pour that the assembly is directly associated to.
Returns: The father pour object
Deprecated since TS v2018.

Tekla.Structures.Model.Assembly.GetFatherPourUnit
Returns the pour unit that the bolt group is associated to.
Returns: A pour unit.

Tekla.Structures.Model.Assembly.SetUserDefinedCoordSys(Tekla.Structures.Geometry3d.CoordinateSystem)
Set user defined assembly coordinate system. If set, GetCoordinateSystem will return this value.
coordinateSystem: The coordinate system.
Returns: True if successful.
Remarks: Currently only supported with rebar assemblies.

Tekla.Structures.Model.Assembly.HasUserDefinedCoordSys
Returns whether the assembly has a user defined coordinate system.
Returns: True if the assembly has a user defined coordinate system.
Remarks: Currently only supported with rebar assemblies.

Tekla.Structures.Model.Assembly.DeleteUserDefinedCoordSys
Deletes the assembly's user defined coordinate system, if it has one.
Returns: True on success.
Remarks: Currently only supported with rebar assemblies.

Tekla.Structures.Model.Assembly.GetSubAssemblies(System.Boolean)
Selects and returns a list of subassemblies belonging to the assembly.
selectSubassemblies: If subassemblies should be selected.
Returns: A list of subassemblies.

Tekla.Structures.Model.Assembly.GetAssemblyId
Returns the assembly identifier the assembly belongs to (null if none).
Returns: The assembly identifier or null.

Tekla.Structures.Model.Assembly.GetSecondaries(System.Boolean)
Selects and returns all the secondary assemblables belonging to the assembly. The method replaces the
old GetObjects() method. Notice that the number of secondaries is limited to 2048.
selectSecondaries: If secondaries should be selected.
Returns: An array list containing all the secondary assemblables belonging to the assembly.

Tekla.Structures.Model.Assembly.GetMainPart(System.Boolean)
Selects and returns the main part of the assembly or null if none.
selectMainPart: If main part should be selected.
Returns: The main part of the assembly or null.

Tekla.Structures.Model.Assembly.Select(Tekla.Structures.Model.ModelObject)
Selects the Assembly based on given part.
ObjectInAssembly: A part belonging to the Assembly
Returns:

Tekla.Structures.Model.Assembly.CheckIfPartCanBeRemovedFromAssembly(Tekla.Structures.Model.Part)
Checks that removed part is not connected to assembly with shop weld or bolt.
part: The part to be checked.
Returns: True if part can be removed from assembly.

Tekla.Structures.Model.Assembly.IsAssemblyPartOfAssembly(Tekla.Structures.Model.Assembly)
Is the assembly part of the current assembly.
Assembly: The assembly to be checked.
Returns: True if the assembly belongs to the current assembly.

Tekla.Structures.Model.Assembly.IsPartOfAssembly(Tekla.Structures.Model.IAssemblable)
Is the assemblable part of the current assembly.
Assemblable: The assemblable to be checked.
Returns: True if the assemblable belongs to the current assembly.

Tekla.Structures.Model.Assembly.CompareTo(Tekla.Structures.Model.Assembly)
Compares the instantiated assembly with another one.
AssemblyToCompare: The assembly to compare with.
Returns: True if there are no differences, false otherwise.
Remarks:
If the numbering hasn't been performed the function will also return false.

Tekla.Structures.Model.Assembly.CreateInstance
Creates a new instance of the Tekla.Structures.Model.Assembly in the model.
Returns: True if successful; otherwise false.

Tekla.Structures.Model.Assembly.ExportArrayListToIntList(System.Collections.ArrayList)
Converts arraylist to intlista and exports it.
arrayList: The array list of ModelObjects.

Tekla.Structures.Model.Assembly.ExportArrayListToDoubleList(System.Collections.ArrayList)
Converts arraylist to DoubleList and exports it.
arrayList: The array list of ModelObjects.

Tekla.Structures.Model.Assembly.UpdateSecondaries(Tekla.Structures.ModelInternal.dotAssembly_t@)
Updates secondaries from IntList after fromstruct.
assembly: The dot assembly.

Tekla.Structures.Model.Assembly.GetArrayListFromDoubleList
Imports DoubleList and returns ArrayList of ints.
Returns: The ArrayList

Tekla.Structures.Model.Assembly.GetArrayListFromIntList
Imports IntList and returns ArrayList.
Returns: The ArrayList

Tekla.Structures.Model.Assembly.GetIntArrayListFromEnumerable(System.Collections.ICollection)
Imports IntList.
Returns: ArrayList of ModelObjects.